title: Detects suspicious nsExec execution
id: 7da8fcf7-21fd-44b2-9f29-f9651132e872
status: experimental
description: Detects suspicious nsExec execution originating from the file in the Downloads folder
author: RussianPanda
date: 2024/11/18
tags:
    - T1059
logsource:
  categoty: process_creation
  product: windows
  service: sysmon
detection:
  selection:
    Image|contains: '\Downloads\'
    ImageLoaded|endswith: 'nsExec.dll'
  condition: selection 
falsepositives:
    - Unknown
level: high
